In [4]:
from pandas import read_csv

In [23]:
df = read_csv('category_prices.csv')

In [30]:
df.head()

                 Id    Category   Price
0  ce23986d60176f19  Category D  $33.03
1  f9a4577a402a5f28  Category C  $89.73
2  7b59c7be326b1069  Category D  $11.30
3  76ebee1b09bff888  Category D  $26.39
4  d4762df27be5ca0c  Category B  $80.58

In [32]:
df['Price'] = (df['Price'].replace( '[\$,)]','', regex=True )
                   .replace( '[(]','-',   regex=True ).astype(float))

In [33]:
df.head()

                 Id    Category  Price
0  ce23986d60176f19  Category D  33.03
1  f9a4577a402a5f28  Category C  89.73
2  7b59c7be326b1069  Category D  11.30
3  76ebee1b09bff888  Category D  26.39
4  d4762df27be5ca0c  Category B  80.58

In [34]:
df.groupby(['Category']).mean()

                Price
Category
Category A  53.065644
Category B  49.398792
Category C  51.206820
Category D  48.825914